qemu-user-targets/CVE-2015-2051/squashfs-root/htdocs/web/hnap/StartFirmwareDownload.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <soap:Body>
    <StartFirmwareDownload xmlns="http://purenetworks.com/HNAP1/">
    </StartFirmwareDownload>
  </soap:Body>
</soap:Envelope>